// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
//
// if (friends.length >= 2){
//     console.log('Це великий масив, в ньому 3 або більше елементів.');
// }  else if (friends.length < 2) {
//     console.log('Це малий масив, в ньому менше 3-х елементів.');
// }


//
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let firstNum = +prompt('Введіть перше число', '');
// let secondNum = +prompt('Введіть друге число', '');
// let thirdNum = +prompt('Введіть третє число', '');
//
// if ((firstNum < secondNum && secondNum < thirdNum) || (thirdNum < secondNum && secondNum < firstNum)) {
//    console.log(secondNum);
// }


// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

// let a = +prompt('Введіть перше число -', '');
// let b = +prompt('Введіть друге число -', '');
//
// let result = (a + b < 4)? 'мало' : 'багато';
// console.log(result);

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// let calc = +prompt('Введіть число щоб дізнатися позитивне воно чи негативне', '')
// if (calc > 0) {
//     alert('Число є позитивним!');
// } else if (calc < 0) {
//     alert('Число є негативним!')
// } else if (calc === 0) {
//     alert('Число дорівнює нулю!')
// }