//
// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
//
// let ArrayOne = [10, 20, 30, 40, 50];
// let ArrayTwo = ['10', '20', '30', '40', '50'];
// let ArrayThree = ['10', true, 30, false, 'owu'];
// console.log(ArrayOne,ArrayTwo,ArrayThree);


// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// let arr = [];
// arr[0] = false;
// arr[1] = true;
// arr[2] = 10;
// arr[3] = '20';
// console.log(arr);


// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

// for (let i = 0; i < 10; i++) {
//     document.write(`<div>Hello world!</div>`);
// };

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині

// for (let i = 0; i < 10; i++) {
//     document.write(`<div>Hello world! ${i+1}</div>`);
// };

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.

// let i = 0;
//
// while (i < 20){
//     document.write(`<h1>Hello world!</h1>`);
//
//     i++
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

// let i = 0;
//
// while (i < 20){
//     document.write(`<h1>Hello world! ${i+1}</h1>`);
//
//     i++
// }

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.

// let arr = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100];
//
// for (let num of arr) {
//     console.log(num);
// }

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.

// let arr = ['10', '20', '30', '40', '50', '60', '70', '80', '90', '100'];
//
// for (let num of arr) {
//     console.log(num);
// }

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

// let arr = ['10', 20, '30', 40, '50', 60, '70', true, '90', false];
//
// for (let num of arr) {
//     console.log(num);
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи

// let arr = ['10', 20, '30', 40, '50', 60, '70', true, '90', false];
//
// for (let i = 0; i <= arr.length; i++) {
//     if (typeof arr[i] === 'boolean') {
//         console.log(arr[i]);
//     }
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
//
// let arr = ['10', 20, '30', 40, '50', 60, '70', true, '90', false];
//
// for (let i = 0; i <= arr.length; i++) {
//     if (typeof arr[i] === 'number') {
//         console.log(arr[i]);
//     }
// }

// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

// let arr = ['10', 20, '30', 40, '50', 60, '70', true, '90', false];
//
// for (let i = 0; i <= arr.length; i++) {
//     if (typeof arr[i] === 'string') {
//         console.log(arr[i]);
//     }
// }


// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.

// let arr = [];
// arr[0] = false;
// arr[1] = true;
// arr[2] = 10;
// arr[3] = '20';
// arr[4] = 1009;
// arr[5] = 'WASD';
// arr[6] = 12540;
// arr[7] = 'hello world!';
// arr[8] = '2kok0';
// arr[9] = '2021';
//
// for (let item of arr){
//     console.log(item);
// }

// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i <= 10; i = i + 2){
//     console.log(i);
//     document.write(`<div>${i}</div>`)
// }

// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i <= 100; i = i + 2){
//     console.log(i);
//     document.write(`<div>${i}</div>`)
// }

// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i <= 100; i = i + 3) {
//     console.log(i);
//     document.write(`<div>${i}</div>`)
// }


// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
//
// for (let i = 0; i <= 100; i++) {
//     if (i % 2 === 0) {
//         console.log(i);
//         document.write(`<div>${i}</div>`)
//     }
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

// for (let i = 0; i <= 100; i++) {
//     if (i % 2 === 1) {
//         console.log(i);
//         document.write(`<div>${i}</div>`)
//     }
// }