// - Дано натуральное число n. Выведите все числа от 1 до n.
//
// function naturalNum(n) {
//     for (let i = 1; i <= n ; i++) {
//         console.log(i);
//     }
// }
//
// naturalNum(10);


// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.

// function twoNums(a, b) {
//     let sum = a;
//     if (a > b) {
//         a = b;
//         b = sum;
//     }
//     for (; a <= b; a++){
//         console.log(a);
//     }
// };
//
// twoNums(115, 120);

// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]


// function reverseArr(arr, i) {
//     let sum = arr[i];// 9
//     arr[i] = arr[i+1]; // 8
//     arr[i+1] = sum; // 9
//     return arr;
// }
//
// console.log(reverseArr([9, 8, 0, 4], 0));


//
// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]


// function goodByeZero(arr) {
//     let newArr = [];
//     for (let i = arr.length - 1; i >= 0; i--)
//         if (arr[i] === 0) {
//             newArr.push(arr[i]);
//         } else {
//             newArr.unshift(arr[i]);
//         }
//     return newArr;
// }
//
// console.log(goodByeZero([0,0,1,0]));