// 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.

// let arr = [];
//
// for (let i = 0; i < 10; i++){
//     let sum = Math.floor(Math.random() * i);
//     arr.push(sum);
// }
//
// let result = arr[0]+' '+arr[1]+' '+arr[2]+' '+arr[3]+' '+arr[4]+' '+arr[5]+' '+arr[6]+' '+arr[7]+' '+arr[8]+' '+arr[9];
//
// console.log(result);


// 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
//
// let book = {
//     name: 'Как варить гречку',
//     numberOfPages: 12,
//     genre: 'Высокая кулинария'
// };

// 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори

// let book = {
//     name: 'Как варить гречку',
//     numberOfPages: 12,
//     genre: 'Высокая кулинария',
//     authors: 'Роберт Дауни Джуниор'
// };


// 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт

// let book1, book2;
//
// let books = [
//     book1 = {
//         name: 'Как варить гречку',
//         numberOfPages: 12,
//         genre: 'Высокая кулинария',
//         authors: 'Роберт Дауни Джуниор'
//     },
//     book2 = {
//         name: 'Как варить рис',
//         numberOfPages: 15,
//         genre: 'Высокая кулинария',
//         authors: 'Роберт Дауни Старший'
//     }
// ];
//
// console.log(books);


// 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.

// let a, b, s;
//
// a = +prompt('Введите высоту', '23');
// b = +prompt('Введите ширину', '10')
// s = (a * b);
// alert(`Ваш результат - ${s}`); //230


// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.
//
// let heightC, dC, v;
// heightC = +prompt('Введіть висоту циліндра в М', '10');
// dC = +prompt('Введіть діаметр основи циліндра в М', '4');
//
// v = Math.floor(Math.PI * Math.pow(dC, 2) * heightC);   // V= π*r2*h= 125 см3. за цією формулою розв'язуємо задачу
//
// alert(`Об'єм циліндру дорівнює = ${v}м`);

// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).

// let n, m, k;
//
// n = prompt('Введіть першу сторону прямокутного трикутника', '3');
// m = prompt('Введіть другу сторону прямокутного трикутника', '4');
// k = Math.sqrt(Math.pow(n, 2) + Math.pow(m, 2));
//
// alert(`Гіпотенуза дорівнює - ${k}`);
