// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let firstNum = +prompt('Введіть перше число -','')
// let secondNum = +prompt('Введіть друге число -','')

// if (firstNum > secondNum){
//     alert(`Число ${firstNum} більше за ${secondNum}.`);
// } else if (secondNum > firstNum){
//     alert(`Число ${secondNum} більше за ${firstNum}.`);
// } else if (firstNum === secondNum){
//     alert(`Число ${secondNum} та ${firstNum} рівні.`);
// }


//
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let flat = +prompt('Введіть номер квартири', '');
// if (flat <= 20) {
//     alert(`Квартира номер ${flat} знаходиться у першому під'їзді`);
// } else if (flat <= 48) {
//     alert(`Квартира номер ${flat} знаходиться у другому під'їзді`);
// } else if (flat <= 90) {
//     alert(`Квартира номер ${flat} знаходиться у третьому під'їзді`);
// } else {
//     alert("Такої квартири не існує :(");
// }


// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let result, a;
// a = +prompt('Задайте числове значення - ', '');
// result = a === 10? 'Вірно' : 'Невірно';
// alert(result);

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else


// let x = ['0'];
// if (typeof x === 'number') {
//     alert('1');
// } else if (typeof x === 'string') {
//     alert('2');
// } else if (typeof x === 'boolean') {
//     alert('3');
// } else if (typeof x === 'object' || 'massive') {
//     alert('-3');
// } else {
//     alert('else');
// }

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН


// let temp = +prompt('Чи йдемо сьогодні в OKTEN на навчання? Ваша температура:', '');
// if (temp >= 10 && temp <= 22){
//     alert('Ми йдемо вчитися!!!');
// } else {
//     alert('Сидимо вдома і вчимося онлайн!');
// }

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let key = prompt('Введіть число від 1 до 5 щоб вийграти приз!!! - ', '');
//
// switch (key) {
//     case '1':
//         alert('Ви програли :(')
//         break;
//     case '2':
//         alert('Ви Вийграли АВТОМОБІЛЬ!!!')
//         break;
//     case '3':
//         alert('Ви програли :(')
//         break;
//     case '4':
//         alert('Ви Вийграли Мотоцикл!!! :)')
//         break;
//     case '5':
//         alert('Ви Вийграли Телефон!!! :)')
//         break;
//     default:
//         alert('Число введено не вірно')
// };
